#+TITLE: Sonar Sweep

** Ruby

#+begin_src ruby :exports both
  increasing_depth_count = 0
  previous_reading = nil
  File.readlines('input').each do |line|
    depth = line.to_i
    if previous_reading && previous_reading < depth
      increasing_depth_count += 1
    end
    previous_reading = depth
  end

  increasing_depth_count
#+end_src

#+RESULTS:
: 1681

** Rust

#+begin_src rust :exports both
  use std::fs::File;
  use std::io::{BufRead, BufReader};

  fn main() {
      let f = File::open("input").expect("Unable to open file");
      let buf = BufReader::new(f);

      let mut increasing_depth_count = 0;
      let mut previous_reading: Option<i32> = None;

      for line in buf.lines() {
          let line = line.expect("Unable to read line");
          let depth = line.parse::<i32>().unwrap();

          if previous_reading.is_some() && previous_reading.unwrap() < depth {
              increasing_depth_count += 1;
          }
          previous_reading = Some(depth);
      }
      println!("{}", increasing_depth_count);
  }
#+end_src

#+RESULTS:
: 1681

** Ruby
#+NAME: initial_solution
#+begin_src ruby :exports both
  increasing_depth_count = 0
  window = []
  previous_window_reading = nil

  File.readlines('input').each do |line|
    depth = line.to_i
    window << depth

    next if window.length < 3

    window_reading = window.sum
    if previous_window_reading && previous_window_reading < window_reading
      increasing_depth_count += 1
    end
    previous_window_reading = window_reading
    window.shift
  end

  increasing_depth_count
#+end_src

#+RESULTS: initial_solution
: 1704

** Rust

#+begin_src rust :exports both :tangle rust/src/main.rs
  use std::fs::File;
  use std::io::{BufRead, BufReader};

  fn main() {
      let f = File::open("input").expect("Unable to open file");
      let buf = BufReader::new(f);

      let mut increasing_depth_count = 0;
      let mut window = Vec::new();
      let mut previous_window_reading: Option<i32> = None;

      for line in buf.lines() {
          let line = line.expect("Unable to read line");
          let depth = line.parse::<i32>().unwrap();
          window.push(depth);

          if window.len() < 3 {
              continue;
          }

          let window_reading: i32 = window.iter().sum();
          if previous_window_reading.is_some() && previous_window_reading.unwrap() < window_reading {
              increasing_depth_count += 1;
          }
          previous_window_reading = Some(window_reading);
          window.remove(0);
      }
      println!("{}", increasing_depth_count);
  }
#+end_src

#+RESULTS:
: 1704

